Repository: sympy/sympy
Catalog: doc/src/tutorial.*.po
Languages: bg, cs

source: Besides the imaginary unit, I, which is imaginary, symbols can be created with attributes (e.g. real, positive, complex, etc...) and this will affect how they behave::
cs: Kromě imaginárního čísla, I, symboly mohou být vytvořeny s atributy (například real, positive, complex, atd...), a to ovlivní jak se budou chovat:

source: Translations
cs: Překlady

source: This tutorial is also available in other languages:
cs: Tento tutoriál je také k dispozici v těchto jazycích:
