Repository: sympy/sympy
Catalog: doc/src/tutorial.*.po
Languages: bg, cs

source: Tutorial
bg: Урок
cs: Tutoriál

source: Introduction
bg: Въведение
cs: Úvod

source: SymPy is a Python library for symbolic mathematics. It aims to become a full-featured computer algebra system (CAS) while keeping the code as simple as possible in order to be comprehensible and easily extensible. SymPy is written entirely in Python and does not require any external libraries.
bg: SymPy е библиотека на Python за символна математика. Тя цели да стане пълнофункционална алгебрична система (CAS - computer algebra system), като поддържа кода възможно най-опростен с цел да бъде разбираем и лесен за разширяване.SymPy е изцяло написана на Python и не изисква външни библиотеки.
cs: SymPy je knihovna jazyka Python pro symbolickou matematiku. Má za cíl stát se kompletním počítačovým algebraickým systémem (CAS, Computer algebra system) a zároveň být co nejjednodušší, aby byla pochopitelná a jednoduše rozšiřitelná. SymPy je napsaná kompletně v jazyce Python a nepotřebuje žádné externí knihovny.

source: This tutorial gives an overview and introduction to SymPy. Read this to have an idea what SymPy can do for you (and how) and if you want to know more, read the :ref:`SymPy User's Guide <guide>`, :ref:`SymPy Modules Reference <module-docs>`. or the `sources <https://github.com/sympy/sympy/>`_ directly.
bg: Този урок е въведение към SymPy. Прочетете го, за да научите какво и как може SymPy, и ако искате да научите повече, прочетете :ref:`SymPy User's Guide <guide>`, :ref:`SymPy Modules Reference <module-docs>`. или `сорс код<https://github.com/sympy/sympy/>`_ директно.
cs: Tento tutoriál je úvodem do SymPy a zároveň ukazuje, co SymPy umí. Přečtěte si ho, aby jste zjistili, jak pro vás může být SymPy užitečná a pokud budete chtít vědět víc, přečtěte si :ref:`Uživatelskou příručku SymPy <guide>`, :ref:`Přehled modulů SymPy <module-docs>`. nebo přímo `zdrojové kódy <https://github.com/sympy/sympy/>`_

source: First Steps with SymPy
bg: Първи стъпки със SymPy
cs: První kroky se SymPy

source: The easiest way to download it is to go to http://code.google.com/p/sympy/ and download the latest tarball from the Featured Downloads:
bg: Най-лесният начин да свалите SymPy е да отидете на http://code.google.com/p/sympy/ и да изтеглите последния архив. .. image:: figures/featured-downloads.png
cs: Nejjednodušší způsob, jak stáhnout SymPy je jít na http://code.google.com/p/sympy/ a stáhnout nejnovější verzi z doporučených zdrojů:

source: Unpack it:
bg: Разархивирайте го:
cs: Rozbalit ji:

source: and try it from a Python interpreter:
bg: и го изпробвайте от интерпретатор на Python:
cs: a vyzkoušet jí v interpretru Pythonu:

source: You can use SymPy as shown above and this is indeed the recommended way if you use it in your program. You can also install it using ``./setup.py install`` as any other Python module, or just install a package in your favourite Linux distribution, e.g.:
bg: Може да използвате SymPy както е показано отгоре, което всъщност е препоръчителният начин, ако го използвате във вашата програма. Също така може да го инсталирате, използвайки ./setup.py install, както който и да е модул на Python,или просто инсталирайте пакет във вашата любима Linux дистрибуция, например:
cs: Můžete používat SymPy, jak vidíte výše, což je doporučený způsob pokud jí používate ve svém programu. Můžete si jí také nainstalovat pomocí ``./setup.py install`` jako každý modul Pythonu nebo si jednoduše nainstalovat balíček do vaší oblíbené distribuce Linuxu. Například:

source: For other means how to install SymPy, consult the Downloads_ tab on the SymPy's webpage.
bg: За други начини за инсталация може да погледнете страницата ни за
cs: Pro další způsoby instalace SymPy si prohlédněte záložku Downloads_ na stránkách SymPy.

source: isympy Console
bg: isympy Конзола
cs: isympy konzole

source: For experimenting with new features, or when figuring out how to do things, you can use our special wrapper around IPython called ``isympy`` (located in ``bin/isympy`` if you are running from the source directory) which is just a standard Python shell that has already imported the relevant SymPy modules and defined the symbols x, y, z and some other things:
bg: За да експериментирате с нови функционалности или когато се опитвате да разберете как да направите нещата, може да използвате нашата специална обвивка около IPython, наречена isympy (намираща се в bin/isympy, ако сте компилирали през сорс директорията), която е стандартна конзола на Python и която включва съответните SymPy модули и дефинираните символи x, y, z, както и някои други неща:

source: Commands entered by you are bold. Thus what we did in 3 lines in a regular Python interpreter can be done in 1 line in isympy.
bg: Командите, въведени от вас, са удебелени. Така, това което направихме в 3 линии на обикновен Python, може да се направи с 1 линия на isympy.
cs: Vámi zadané příkazy jsou tučně. Vidíme, že to, co bychom udělali ve 3 řádcích v běžném interpretru Pythonu, lze udělat v isympy v 1 řádku.

source: Using SymPy as a calculator
bg: Използване на SymPy като калкулатор
cs: SymPy jako kalkulačka

source: SymPy has three built-in numeric types: Float, Rational and Integer.
bg: SymPy има 3 вградени типове числа: Цели, с плаваща запетая и рационални.

source: The Rational class represents a rational number as a pair of two Integers: the numerator and the denominator. So Rational(1,2) represents 1/2, Rational(5,2) represents 5/2, and so on.
bg: Рационалният клас представлява рационална дроб като двойка от цели числа: числителя и знаменателя, така че Rational(1,2) представлява 1/2, Rational(5,2) 5/2 и така нататък.
cs: Třída Rational reprezentuje racionální čísla jako dvojici Integerů: čitatel a jmenovatel Takže Rational(1,2) reprezentuje 1/2, Ration(5,2) reprezentuje 5/2, a tak dále.

source: Proceed with caution while working with Python int's and floating point numbers, especially in division, since you may create a Python number, not a SymPy number. A ratio of two Python ints may create a float -- the "true division" standard of Python 3 and the default behavior of ``isympy`` which imports division from __future__::
bg: Бъдете предпазливи, когато работите с цели и с плаваща запетая числа в Python особено когато делите, защото може да създадете Python число, а не SymPy число. От съотношението на 2 цели числа в Python може да се получи число с плаваща запетая -- "истинското деление", което е стандарт в Python 3, и подразбиращото се поведение на ``isympy``, което въвежда делението от __future__::
cs: Postupujte opatrně, když pracujete s Inty a Floaty v Pythonu, obzvlášť při dělení, jelikož můžete vytvořit číslo Pythonu místo SymPy. Podíl dvou Intů v Pythonu může vytvořit Float -- "pravé dělení", standard Pythonu 3 a defaultní chování ``isympy``, které vkládá dělení z __future__::

source: But in earlier Python versions where division has not been imported, a truncated int will result::
bg: Но в по-ранните версии на Python, където "истинското делението" не бе въведено, като резултат ще бъде закръглено число::
cs: Ale v dřívějších verzích Pythonu, kde nebylo dělení zakomponováno, vyšel oříznutý int::

source: In both cases, however, you are not dealing with a SymPy Number because Python created its own number. Most of the time you will probably be working with Rational numbers, so make sure to use Rational to get the SymPy result. One might find it convenient to equate ``R`` and Rational::
bg: Все пак и в двата случая не използваме SymPy числа, защото Python създава свои собствени. През повечето време най-вероятно ще работите с рационални числа, така че се уверете, че използвате Rational, за да получите очаквания резултат. Може да сметнете за удобно да използвате ``R`` като Rational::
cs: V obou případech se nejedná o číslo SymPy, protože Python vytvořil své vlastní číslo. Většinu času budete pravděpodobně pracovat s čísly Rational, takže dávejte pozor, abyste používali Rational a dostali tak výsledek SymPy. Někomu může připadat příhodné používat místo dlouhého Rational krátké ``R``::

source: We also have some special constants, like e and pi, that are treated as symbols (1+pi won't evaluate to something numeric, rather it will remain as 1+pi), and have arbitrary precision::
bg: Ние също така имаме някои специални константи, като e и pi, които се третират като символи (1+pi няма да се изчисли като някое число, а ще си остане 1+pi) и имат арбитрарна точност::
cs: Také máme k dispozici několik konstant, jak e nebo pí, se kterými se pracuje jako se symboly (1+pi se nevypočítá jako numerická hodnota, ale ponechá se 1+pi) a mají libovolnou přesnost::

source: as you see, evalf evaluates the expression to a floating-point number
bg: Както виждате, evalf изчислява израза до число с плаваща запетая.
cs: jak vidíte, evalf vyhodnotí výraz na číslo s pohyblivou desetinnou čárkou.

source: The symbol ``oo`` is used for a class defining mathematical infinity::
bg: Също така има и клас, представляващ математическа безкрайност, наречен ``oo``::
cs: Symbol ``oo`` se používá pro třídu definující matematické nekonečno::

source: Symbols
bg: Символи
cs: Symboly

source: In contrast to other Computer Algebra Systems, in SymPy you have to declare symbolic variables explicitly::
bg: За разлика от други компютърни алгебрични системи (CAS), в SymPy вие трябва изрично да декларирате символните променливи::
cs: Narozdíl od jiných počítačových algebraických systémů, v SymPy je třeba explicitně deklarovat symbolické proměnné::

source: On the left is the normal Python variable which has been assigned to the SymPy Symbol class. Predefined symbols (including those for symbols with Greek names) are available for import from abc:
bg: Отляво е променливата, на която задаваме като стойност инстанция на SymPy класа Symbol. Инстанциите на този клас могат да се комбинират и да направят израз::

source: Instances of the Symbol class "play well together" and are the building blocks of expresions::
bg: Инстанциите на този клас могат да се комбинират и да направят израз::

source: They can be substituted with other numbers, symbols or expressions using ``subs(old, new)``::
bg: И да ги замествате с други символи или числа като използвате ``subs(old, new)``::
cs: Mohou být nahrazeny jinými čísly, symboly nebo výrazy použitím ``subs(stary, novy)``::

source: For the remainder of the tutorial, we assume that we have run::
bg: До края на този урок предполагаме, че сте изпълнили следния код::
cs: Pro celý zbytek tutoriálu předpokládejme, že jsme zadali::

source: This will make things look better when printed. See the :ref:`printing-tutorial` section below. If you have a unicode font installed, you can pass use_unicode=True for a slightly nicer output.
bg: Това ще направи нещата да изглеждат по-добре, когато се принтират (pretty printing). Погледнете секцията за принтиране по-нататък. Ако имате инсталиран някой unicode шрифт, може да подадете use_unicode=True за доста по-красив изход.
cs: To nám zajistí hezčí výstup. Koukněte do sekce níže :ref:`printing-tutorial-cs`. Pokud máte nainstalovaný font unicode, volbou ``use_unicode=True`` dostanete o něco hezčí výstup.

source: Algebra
bg: Алгебра

source: For partial fraction decomposition, use ``apart(expr, x)``::
bg: За да разложите непълни дроби, използвайте ``apart(expr, x)``::
cs: Pro rozklad na parciální zlomky, použijte ``apart(expr, x)``::

source: To combine things back together, use ``together(expr, x)``::
bg: За да комбинирате нещата отново заедно, използвайте ``together(expr, x)``::
cs: Pro zpětné sdružení věcí dohromady, použijte ``together(expr, x)``::

source: Calculus
bg: Висша математика
cs: Analýza

source: Limits
bg: Граници
cs: Limity

source: Limits are easy to use in SymPy, they follow the syntax ``limit(function, variable, point)``, so to compute the limit of f(x) as x -> 0, you would issue ``limit(f, x, 0)``::
bg: Границите са изключително лесни за използване в SymPy. Те имат следния синтаксис limit(function, variable, point), така че за да изчислите границата на f(x), където x -> 0 бихте използвали ``limit(f, x, 0)``::

source: you can also calculate the limit at infinity::
bg: също така може да изчислите граница до безкрайност::
cs: také můžete spočítat limitu v nekonečnu::

source: for some non-trivial examples on limits, you can read the test file `test_demidovich.py <https://github.com/sympy/sympy/blob/master/sympy/series/tests/test_demidovich.py>`_
bg: За някои не толкова тривиални примери, може да прегледате тестовия файл `test_demidovich.py <https://github.com/sympy/sympy/blob/master/sympy/series/tests/test_demidovich.py>`_
cs: pro některé netriviální příklady limit si můžete přečíst testovací soubor `test_demidovich.py <https://github.com/sympy/sympy/blob/master/sympy/series/tests/test_demidovich.py>`_

source: Differentiation
bg: Диференциално смятане
cs: Derivace

source: You can differentiate any SymPy expression using ``diff(func, var)``. Examples::
bg: Може да изчислите производните на който и да е израз в SymPy, като използвате ``diff(func, var)``. Примери::
cs: Můžete derivovat libovolný výraz v SymPy pomocí ``diff(func, var)``. Například::

source: You can check, that it is correct by::
bg: Можете да проверите, че е правилно, като::
cs: Výsledek si můžete zkontrolovat::

source: Higher derivatives can be calculated using the ``diff(func, var, n)`` method::
bg: Производни от по-висок ред могат да бъдат пресметнати чрез използването на метода ``diff(func, var, n)`` ::
cs: Vyšší derivace můžete spočítat pomocí ``diff(func, var, n)``::

source: Series expansion
bg: Разлагане в ред
cs: Rozvoj v řady

source: Use ``.series(var, point, order)``::
bg: Използвайте метода ``.series(var, point, order)``::
cs: Použijte ``.series(var, point, order)``::

source: Another simple example::
bg: Друг прост пример::
cs: Další jednoduchý příklad::

source: Integration
bg: Интегриране
cs: Integrály

source: SymPy has support for indefinite and definite integration of transcendental elementary and special functions via ``integrate()`` facility, which uses powerful extended Risch-Norman algorithm and some heuristics and pattern matching::
bg: SymPy поддръжа определени и неопределени интеграли на елементарни и специални трансцедентни функции с помощта на integrate(), който използва мощния разширен алгоритъм на Risch-Norman и няколко еврестики и сравнения с шаблони::
cs: SymPy umí počítat neurčité a určité integrály elementárních a speciálních transcendentních funkcí pomocí fuknce ``integrate()``, která využívá silného rozšířeného Risch-Normanova algoritmu, některých heuristik a porovnávání vzorků::

source: You can integrate elementary functions::
bg: Можете да декларирате елементарни функции::
cs: Můžete integrovat elementární funkce::

source: Also special functions are handled easily::
bg: Лесно можете да се справите и със специалните функции::
cs: Také speciální funkce lze jednoduše integrovat::

source: It is possible to compute definite integrals::
bg: Възможно е да изчислите даден интеграл::

source: Also, improper integrals are supported as well::
bg: Също така се поддържат и неопределени интеграли::

source: Complex numbers
bg: Комплексни числа
cs: Komplexní čísla

source: Functions
bg: Функции
cs: Funkce

source: **trigonometric**::
bg: **тригонометрични**::
cs: **trigonometrické**::

source: **spherical harmonics**::
bg: **сферични хармонични**::
cs: **Sférické funkce**::

source: **factorials and gamma function**::
bg: **факториел и гама функции**::
cs: **Faktoriály a gamma funkce**::

source: **zeta function**::
bg: **дзета функции**::
cs: **Zeta funkce**::

source: **polynomials**::
bg: **полиноми**::
cs: **Polynomy**::

source: Differential Equations
bg: Диференциални уравнения
cs: Diferenciální rovnice

source: In ``isympy``::
bg: В ``isympy``::
cs: V ``isympy``::

source: Algebraic equations
bg: Алгебрични уравнения
cs: Algebraické rovnice

source: Linear Algebra
bg: Линейна алгебра
cs: Lineární algebra

source: Matrices
bg: Матрици
cs: Matice

source: Matrices are created as instances from the Matrix class::
bg: Матриците се създават като инстанции на Matrix класа::
cs: Matice jsou vytvořeny jako instance třídy Matrix::

source: They can also contain symbols::
bg: също така може да слагате символи в тях::

source: For more about Matrices, see the Linear Algebra tutorial.
bg: За повече информация и примери с матрици вижте Linear Algebra tutorial.

source: Pattern matching
bg: Сравняване на шаблони
cs: Porovnávání vzorků

source: Use the ``.match()`` method, along with the ``Wild`` class, to perform pattern matching on expressions. The method will return a dictionary with the required substitutions, as follows::
bg: Използвайте ``.match()`` метода заедно с класа Wild за да сравнявате изрази с даден шаблон. Методът ще върне речник с изисканите замествания, както следва::
cs: Použijte metodu ``.match()`` spolu s třídou ``Wild`` pro porovnávání výrazů. Metoda vrátí slovník s požadovanými substitucemi, jako vidíme zde::

source: If the match is unsuccessful, it returns ``None``::
bg: Ако съвпадението е неуспешно, методът връща ``None``::
cs: Pokud je porovnání neúspěšné, vrátí ``None``::

source: One can also use the exclude parameter of the ``Wild`` class to ensure that certain things do not show up in the result::
bg: Можете да използвате и втория незадължителен параметър exclude, за да се уверите, че някои неща не се появяват в резултата::
cs: Lze také použít parametr ``exclude`` třídy ``Wild``, aby se určité věci nezobrazily ve výsledku::

source: Printing
bg: Принтиране
cs: Výpis

source: There are many ways to print expressions.
bg: Има много начини, по които изразите може да се отпечатат.
cs: Je spousta způsobů, jak mohou být výrazy vypisovány.

source: **Standard**
bg: **Стандартен начин**
cs: **Standardní**

source: This is what ``str(expression)`` returns and it looks like this:
bg: Това е резултатът от ``str(expression)`` и изглежда така:
cs: To je to, co vrátí ``str(expression)`` a vypadá to takto::

source: **Pretty printing**
bg: **Красиво отпечатване (pretty printing)**
cs: **Pěkný výpis**

source: Nice ascii-art printing is produced by the ``pprint`` function:
bg: Това е хубаво отпечатване тип ascii-art, направено от ``pprint`` функция:

source: If you have a unicode font installed, the ``pprint`` function will use it by default. You can override this using the ``use_unicode`` option.:
bg: Ако имате инсталиран unicode шрифт, то той би трябвало да бъде използван по подразбиране. Може смените това поведение, като използвате опцията ``use_unicode``.:

source: See also the wiki `Pretty Printing <https://github.com/sympy/sympy/wiki/Pretty-Printing>`_ for more examples of a nice unicode printing.
bg: Също така вижте уикито `Pretty Printing <https://github.com/sympy/sympy/wiki/Pretty-Printing>`_ за повече примери за добро unicode принтиране.
cs: Pro více příkladů pěkného unicode výstupu koukněte na wiki na `Pretty Printing <https://github.com/sympy/sympy/wiki/Pretty-Printing>`_

source: Tip: To make pretty printing the default in the Python interpreter, use::
bg: Съвет:За да направите красивото отпечатване(pretty printing) по подразбиране в интерпретатора на Python, използвайте::

source: **Python printing**
bg: **Python отпечатване**
cs: **Python výstup**::

source: **LaTeX printing**
bg: **LaTeX отпечатване**
cs: **LaTeX výstup**::

source: If pyglet is installed, a pyglet window will open containing the LaTeX rendered expression:
bg: И pyglet прозорец с LaTeX рендиран израз ще се появи:

source: Notes
bg: Бележки
cs: Poznámky

source: ``isympy`` calls ``pprint`` automatically, so that's why you see pretty printing by default.
bg: ``isympy`` извиква ``pprint`` автоматично, поради тази причина виждате красивото отпечатване (pretty printing) по подразбиране.
cs: ``isympy`` volá ``pprint`` automaticky, proto standardně vidíte pěkný výpis.

source: Note that there is also a printing module available, ``sympy.printing``. Other printing methods available through this module are:
bg: Забележете, че също така има модул за принтиране, ``sympy.printing``. Други методи за принтиране, налични чрез този модул, са:
cs: Všimněte si, že je přístupný modul pro výpisy, ``sympy.printing``. Další metody dostupné díky tomuto modulu jsou:

source: ``pretty(expr)``, ``pretty_print(expr)``, ``pprint(expr)``: Return or print, respectively, a pretty representation of ``expr``. This is the same as the second level of representation described above.
bg: ``pretty(expr)``, ``pretty_print(expr)``, ``pprint(expr)``: Връща или принтира, съответно, красива репрезентация на ``expr``. Това е еквивалентно на второто ниво на репрезентация показано по-горе.
cs: * ``pretty(expr)``, ``pretty_print(expr)``, ``pprint(expr)``: Vrací respektive vypisuje, pěknou reprezentaci ``expr``. Je to jako druhá úroveň reprezentace popsané výše.

source: ``latex(expr)``, ``print_latex(expr)``: Return or print, respectively, a `LaTeX <http://www.latex-project.org/>`_ representation of ``expr``
bg: ``latex(expr)``, ``print_latex(expr)``: Връща или принтира, съответно, `LaTeX <http://www.latex-project.org/>`_ репрезентация на ``expr``
cs: ``latex(expr)``, ``print_latex(expr)``: Vrací, respektive vypisuje, `LaTeX <http://www.latex-project.org/>`_ reprezentaci ``expr``

source: ``mathml(expr)``, ``print_mathml(expr)``: Return or print, respectively, a `MathML <http://www.w3.org/Math/>`_ representation of ``expr``.
bg: ``mathml(expr)``, ``print_mathml(expr)``: Връща или принтира, съответно, `MathML <http://www.w3.org/Math/>`_ репрезентация на ``expr``.
cs: ``mathml(expr)``, ``print_mathml(expr)``: Vrací, respektive vypisuje, `MathML <http://www.w3.org/Math/>`_ reprezentaci ``expr``.

source: ``print_gtk(expr)``: Print ``expr`` to `Gtkmathview <http://helm.cs.unibo.it/mml-widget/>`_, a GTK widget that displays MathML code. The `Gtkmathview <http://helm.cs.unibo.it/mml-widget/>`_ program is required.
bg: ``print_gtk(expr)``: Принтира ``expr`` на `Gtkmathview <http://helm.cs.unibo.it/mml-widget/>`_, GTK интрумент, който визуализира MathML код. Изисква се `Gtkmathview <http://helm.cs.unibo.it/mml-widget/>`_ .
cs: ``print_gtk(expr)``: Vypisuje ``expr`` do `Gtkmathview <http://helm.cs.unibo.it/mml-widget/>`_, GTK widgetu, který zobrazuje MathML kód. Je vyžadován program `Gtkmathview <http://helm.cs.unibo.it/mml-widget/>`_.

source: Further documentation
bg: Допълнителна документация
cs: Další dokumentace

source: Now it's time to learn more about SymPy. Go through the :ref:`SymPy User's Guide <guide>` and :ref:`SymPy Modules Reference <module-docs>`.
bg: Време е да научите повече за SymPy. Прегледайте :ref:`SymPy User's Guide <guide>` и :ref:`SymPy Modules Reference <module-docs>`.
cs: Nyní je čas dozvědět se více o SymPy. Pročtěte si :ref:`Uživatelskou příručku SymPy <guide>` a :ref:`Přehled modulů SymPy <module-docs>`.

source: Be sure to also browse our public `wiki.sympy.org <http://wiki.sympy.org/>`_, that contains a lot of useful examples, tutorials, cookbooks that we and our users contributed, and feel free to edit it.
bg: Не пропускайте и да прегледате нашето публично уики – `wiki.sympy.org <http://wiki.sympy.org/>`_, което съдържа много полезни примери, уроци и наръчници, за които ние и нашите потребители допринасяме и Ви окуражаваме да редактирате и подобрите.

source: Symbols can also be created with the ``symbols`` or ``var`` functions, the latter automatically adding the created symbols to the namespace, and both accepting a range notation:
cs: Symboly mohou být vytvořeny pomocí funkcí ``symbols`` nebo ``var``, kde funkce ``var`` automaticky přídá vytvořené symboly do namespace, a jak ``symbols``, tak ``var`` podporují range notaci:
